Revit 2027 API
BuiltInFailures.SketchFailures.StairTooManyConnectedBoundariesError Property
 Stairs require no more than two boundaries (chains of one or more Boundary Lines).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairTooManyConnectedBoundariesError { get; }
Public Shared ReadOnly Property StairTooManyConnectedBoundariesError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairTooManyConnectedBoundariesError {
	FailureDefinitionId^ get ();
}
static member StairTooManyConnectedBoundariesError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace